{
  "documents": [
    "Startups in 13 Sentences\n\nStartups in 13 Sentences\n\nWant to start a startup?\n Get funded by\n\nY Combinator\n.\n\nWatch how this essay was\n\nwritten\n.\n\nFebruary 2009\nOne of the things I always tell startups is a principle I learned\nfrom Paul Buchheit: it's better to make a few people really happy\nthan to make a lot of people semi-happy. I was saying recently to\na reporter that if I could only tell",
    "recently to\na reporter that if I could only tell startups 10 things, this would\nbe one of them. Then I thought: what would the other 9 be?\nWhen I made the list there turned out to be 13:\n\n1. Pick good cofounders.\nCofounders are for a startup what location is for real estate. You\ncan change anything about a house except where it is. In a startup\nyou can change your idea easily, but changing your",
    "can change your idea easily, but changing your cofounders is\nhard. \n\n[\n1\n]\n\nAnd the success of a startup is almost always a function\nof its founders.\n2. Launch fast.\nThe reason to launch fast is not so much that it's critical to get\nyour product to market early, but that you haven't really started\nworking on it till you've launched. Launching teaches you what you\nshould have been building. Till",
    "you what you\nshould have been building. Till you know that you're wasting your\ntime. So the main value of whatever you launch with is as a pretext\nfor engaging users.\n3. Let your idea evolve.\nThis is the second half of launching fast. Launch fast and iterate.\nIt's a big mistake to treat a startup as if it were merely a matter\nof implementing some brilliant initial idea. As in an essay, most\nof the",
    "initial idea. As in an essay, most\nof the ideas appear in the implementing.\n4. Understand your users.\nYou can envision the wealth created by a startup as a rectangle,\nwhere one side is the number of users and the other is how much you\nimprove their lives.\n\n[\n2\n]\n\nThe second dimension is the one you have\nmost control over. And indeed, the growth in the first will be\ndriven by how well you do in the",
    "the first will be\ndriven by how well you do in the second. As in science, the hard\npart is not answering questions but asking them: the hard part is\nseeing something new that users lack. The better you understand\nthem the better the odds of doing that. That's why so many successful\nstartups make something the founders needed.\n5. Better to make a few users love you than a lot ambivalent.\nIdeally",
    "few users love you than a lot ambivalent.\nIdeally you want to make large numbers of users love you, but you\ncan't expect to hit that right away. Initially you have to choose\nbetween satisfying all the needs of a subset of potential users,\nor satisfying a subset of the needs of all potential users. Take\nthe first. It's easier to expand userwise than satisfactionwise.\nAnd perhaps more importantly,",
    "satisfactionwise.\nAnd perhaps more importantly, it's harder to lie to yourself. If\nyou think you're 85% of the way to a great product, how do you know\nit's not 70%? Or 10%? Whereas it's easy to know how many users\nyou have.\n6. Offer surprisingly good customer service.\nCustomers are used to being maltreated. Most of the companies they\ndeal with are quasi-monopolies that get away with atrocious",
    "are quasi-monopolies that get away with atrocious customer\nservice. Your own ideas about what's possible have been unconsciously\nlowered by such experiences. Try making your customer service not\nmerely good, but \n\nsurprisingly good\n. Go out of your way to make\npeople happy. They'll be overwhelmed; you'll see. In the earliest\nstages of a startup, it pays to offer customer service on a level\nthat",
    "it pays to offer customer service on a level\nthat wouldn't scale, because it's a way of learning about your\nusers.\n7. You make what you measure.\nI learned this one from Joe Kraus. \n\n[\n3\n]\n\nMerely measuring something\nhas an uncanny tendency to improve it. If you want to make your\nuser numbers go up, put a big piece of paper on your wall and every\nday plot the number of users. You'll be delighted"
  ],
  "ids": [
    "0",
    "1",
    "2",
    "3",
    "4",
    "5",
    "6",
    "7",
    "8",
    "9"
  ],
  "metadatas": [
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null
  ]
}